app/Models/M_add_user.php

INSERT INTO `user` (`username`, `password`, `name`, `email`) VALUES ('hallo', '1', 'hal lo', 'hallo@gmail.com')
---
    public function add_user($data)
    {
        $this->db->table('user')->insert($data);