app/Models/M_login.php

SELECT *
FROM `user`
WHERE `username` = 'user1'
AND `password` = '123'
---
    public function get_data($username, $password)
    {
        return $this->db->table('user')
            ->where(array('username' => $username, 'password' => $password))
            ->get()->getRowArray();

SELECT *
FROM `user`
---
    public function get_all_data()
    {
        $db = \Config\Database::connect(); // Mendapatkan objek database baru
        return $db->table('user')
            ->get()->getResultArray();